#==============================================================================
# ★ RGSS3_アイテム操作コマンド Ver1.1
#==============================================================================
=begin

作者：tomoaky
webサイト：ひきも記 (http://hikimoki.sakura.ne.jp/)

すべてのアイテムを入手、などのコマンドを追加します。
イベントコマンド『スクリプト』で以下を実行してください。

  gain_all_item         # すべてのアイテムを手に入れる
  gain_all_normalitem   # すべてのアイテムを手に入れる
  gain_all_keyitem      # すべてのアイテムを手に入れる
  gain_all_weapon       # すべての武器を手に入れる
  gain_all_armor        # すべての防具を手に入れる
  gain_all_shield       # すべての盾を手に入れる
  gain_all_helm         # すべての頭防具を手に入れる
  gain_all_dress        # すべての身体防具を手に入れる
  gain_all_accessory    # すべての装飾品を手に入れる
  lose_all_item         # すべてのアイテムを捨てる
  lose_all_normalitem   # すべてのアイテムを捨てる
  lose_all_keyitem      # すべてのアイテムを捨てる
  lose_all_weapon       # すべての武器を捨てる
  lose_all_armor        # すべての防具を捨てる
  lose_all_shield       # すべての盾を捨てる
  lose_all_helm         # すべての頭防具を捨てる
  lose_all_dress        # すべての身体防具を捨てる
  lose_all_accessory    # すべての装飾品を捨てる
  equip_weapon_bm?(weapon_id) # 戦闘メンバーが指定した番号の武器を装備してるか
  equip_armor_bm?(armor_id)   # 戦闘メンバーが指定した番号の防具を装備してるか


2012.01.20  Ver1.1
  equip_weapon_bm? / equip_armor_bm? を追加
  
2012.01.18　Ver1.0
  公開

=end

#==============================================================================
# ■ Game_Interpreter
#==============================================================================
class Game_Interpreter
  #--------------------------------------------------------------------------
  # ○ すべてのアイテムを手に入れる
  #--------------------------------------------------------------------------
  def gain_all_item(n = 99, filter = [1, 2])
    $data_items.each do |item|
      if item && item.name != "" && filter.include?(item.itype_id)
        $game_party.gain_item(item, n)
      end
    end
  end
  #--------------------------------------------------------------------------
  # ○ すべての通常アイテムを手に入れる
  #--------------------------------------------------------------------------
  def gain_all_normalitem(n = 99);  gain_all_item(n, [1]);  end
  #--------------------------------------------------------------------------
  # ○ すべての大事なものを手に入れる
  #--------------------------------------------------------------------------
  def gain_all_keyitem(n = 99);     gain_all_item(n, [2]);  end
  #--------------------------------------------------------------------------
  # ○ すべての武器を手に入れる
  #--------------------------------------------------------------------------
  def gain_all_weapon(n = 99)
    $data_weapons.each do |item|
      $game_party.gain_item(item, n) if item && item.name != ""
    end
  end
  #--------------------------------------------------------------------------
  # ○ すべての防具を手に入れる
  #--------------------------------------------------------------------------
  def gain_all_armor(n = 99, filter = [1, 2, 3, 4])
    $data_armors.each do |item|
      if item && item.name != "" && filter.include?(item.etype_id)
        $game_party.gain_item(item, n) 
      end
    end
  end
  #--------------------------------------------------------------------------
  # ○ すべての盾を手に入れる
  #--------------------------------------------------------------------------
  def gain_all_shield(n = 99);    gain_all_armor(n, [1]); end
  #--------------------------------------------------------------------------
  # ○ すべての頭防具を手に入れる
  #--------------------------------------------------------------------------
  def gain_all_helm(n = 99);      gain_all_armor(n, [2]); end
  #--------------------------------------------------------------------------
  # ○ すべての身体防具を手に入れる
  #--------------------------------------------------------------------------
  def gain_all_dress(n = 99);     gain_all_armor(n, [3]); end
  #--------------------------------------------------------------------------
  # ○ すべての装飾品を手に入れる
  #--------------------------------------------------------------------------
  def gain_all_accessory(n = 99); gain_all_armor(n, [4]); end
  #--------------------------------------------------------------------------
  # ○ すべてのアイテムを捨てる
  #--------------------------------------------------------------------------
  def lose_all_item(filter = [1, 2])
    $data_items.each do |item|
      $game_party.lose_item(item, 99999) if item && filter.include?(item.itype_id)
    end
  end
  #--------------------------------------------------------------------------
  # ○ すべての通常アイテムを捨てる
  #--------------------------------------------------------------------------
  def lose_all_normalitem;  lose_all_item([1]); end
  #--------------------------------------------------------------------------
  # ○ すべての大事なものを捨てる
  #--------------------------------------------------------------------------
  def lose_all_keyitem;     lose_all_item([2]); end
  #--------------------------------------------------------------------------
  # ○ すべての武器を捨てる
  #--------------------------------------------------------------------------
  def lose_all_weapon
    $data_weapons.each do |item|
      $game_party.lose_item(item, 99999) if item
    end
  end
  #--------------------------------------------------------------------------
  # ○ すべての防具を捨てる
  #--------------------------------------------------------------------------
  def lose_all_armor(filter = [1, 2, 3, 4])
    $data_armors.each do |item|
      $game_party.lose_item(item, 99999) if item && filter.include?(item.etype_id)
    end
  end
  #--------------------------------------------------------------------------
  # ○ すべての盾を捨てる
  #--------------------------------------------------------------------------
  def lose_all_shield;    lose_all_armor(filter = [1]); end
  #--------------------------------------------------------------------------
  # ○ すべての頭防具を捨てる
  #--------------------------------------------------------------------------
  def lose_all_helm;      lose_all_armor(filter = [2]); end
  #--------------------------------------------------------------------------
  # ○ すべての身体防具を捨てる
  #--------------------------------------------------------------------------
  def lose_all_dress;     lose_all_armor(filter = [3]); end
  #--------------------------------------------------------------------------
  # ○ すべての装飾品を捨てる
  #--------------------------------------------------------------------------
  def lose_all_accessory; lose_all_armor(filter = [4]); end
  #--------------------------------------------------------------------------
  # ○ 戦闘メンバーが指定した武器を装備しているか
  #--------------------------------------------------------------------------
  def equip_weapon_bm?(weapon_id)
    item = $data_weapons[weapon_id]
    $game_party.battle_members.any? {|actor| actor.weapons.include?(item) }
  end
  #--------------------------------------------------------------------------
  # ○ 戦闘メンバーが指定した防具を装備しているか
  #--------------------------------------------------------------------------
  def equip_armor_bm?(armor_id)
    item = $data_armors[armor_id]
    $game_party.battle_members.any? {|actor| actor.armors.include?(item) }
  end
end

