#------------------------------------------------------------------------------
# 　常に効果が発動するスキル
#==============================================================================
#
#     ■パッシブスキル Ver 1.01    2013/2/18
#
#  使い方：( ここに追加 )以下、main以上のところにコピーする。
#
#    １．適当なクラスの特徴リストにスキルの発動効果を設定する。(例：最大HP*150%)
#    ２．パッシブスキルとなるスキルの属性を設定する。(初期は16番目。変更可)
#    ３．そのスキルの速度の数値を先ほどのクラスのIDに設定する。
#     
#        これで所持しているだけで効果が発動するパッシブスキルが作れます。
#        詳しい解説はブログに掲載しています。
#
#・バグの報告や質問、要望がありましたらこちらへお願いします。
#
#    Gossum magazine     http://gossum.blog.fc2.com/
#
#==============================================================================

  # この数値の属性IDがパッシブスキルとなります。
  GOSS_PASSIVE_ID = 16
  
  # 戦闘中のウィンドウでもパッシブスキルを表示するならtrue
  GOSS_PASSIVE_FLAG = false
  
  class Game_Actor < Game_Battler
  #--------------------------------------------------------------------------
  # ● 全ての特徴オブジェクトの配列取得
  #--------------------------------------------------------------------------
  alias goss_feature_objects feature_objects
  def feature_objects
    all = goss_feature_objects
    return all if @avoid_nest == true
    @avoid_nest = true
    for skill in skills
      if skill.damage.element_id == GOSS_PASSIVE_ID
        all += [$data_classes[skill.speed]]
      end
    end
    @avoid_nest = false
    return all
  end
end
#==============================================================================
# ■ Window_BattleSkill
#------------------------------------------------------------------------------
# 　バトル画面で、使用するスキルを選択するウィンドウです。
#==============================================================================

class Window_BattleSkill < Window_SkillList
  #--------------------------------------------------------------------------
  # ● スキルをリストに含めるかどうか
  #--------------------------------------------------------------------------
  def include?(item)
    if item.damage.element_id == GOSS_PASSIVE_ID
      GOSS_PASSIVE_FLAG
    else
      super(item)
    end
  end
end