 
#==============================================================================
#                   「簡単コマンドカスタム」(ACE) ver.1.1
#   製作者：奈々（なな）
#   へぷたなすくろーる http://heptanas.mamagoto.com/
#
#   ◇使用規約
#   使用される場合はスクリプト作成者として「奈々」を明記して下さい。
#   このスクリプトを改変したり、改変したものを配布するなどは自由ですが
#   その場合も元のスクリプトの作成者として名前は載せて下さい。
#   その他、詳しい利用規約はブログを参照して下さい。
#
#------------------------------------------------------------------------------
#
#   メニューコマンド及びアクターコマンドを
#   自由な順番に並べ替えます。（削除も可能）
#   
#   使い方は、初期設定でリストに順番を指定するだけです。
#   特定のコマンドを書かずにコマンドから消すことも出来ます。
#   
#   なるべく競合しないように作っていますが
#   もし他のスクリプトと干渉した場合は
#   スクリプトリストの順番を入れ替えて試してみて下さい。
#
#==============================================================================

#◇初期設定
module Nana
module KCC
  
  #メニューコマンドの設定
  # 1:アイテム  2:スキル  3:装備  4:ステータス
  # 5:並び替え  6:セーブ  7:ゲーム終了  8:その他
  # 10-:他素材「オリジナルメニューコマンド」で使用
  MENU = [1, 2, 3, 4, 10, 13, 8, 6, 7, 14]
  
  #アクターコマンド（共通）の設定
  # 1:攻撃  2:各スキル  3:防御  4:アイテム
  # 10-:他素材「オリジナルアクターコマンド」で使用
  ACTOR = [2, 3, 4]
  
end
end

#==============================================================================
# ■ Window_MenuCommand
#------------------------------------------------------------------------------
# 　メニュー画面で表示するコマンドウィンドウです。
#==============================================================================

class Window_MenuCommand < Window_Command
  #--------------------------------------------------------------------------
  # ● コマンドリストの作成
  #--------------------------------------------------------------------------
  def make_command_list
    Nana::KCC::MENU.each do |n|
      case n
      when 1
        add_command(Vocab::item,   :item,   main_commands_enabled)
      when 2
        add_command(Vocab::skill,  :skill,  main_commands_enabled)
      when 3
        add_command(Vocab::equip,  :equip,  main_commands_enabled)
      when 4
        add_command(Vocab::status, :status, main_commands_enabled)
      when 5
        add_formation_command
      when 6
        add_save_command
      when 7
        add_game_end_command
      when 8
        add_original_commands
      else
        add_n7_original_command(n) if Nana::OMC::C
      end
    end
  end
end

#==============================================================================
# ■ Window_ActorCommand
#------------------------------------------------------------------------------
# 　バトル画面で、アクターの行動を選択するウィンドウです。
#==============================================================================

class Window_ActorCommand < Window_Command
  #--------------------------------------------------------------------------
  # ● コマンドリストの作成
  #--------------------------------------------------------------------------
  def make_command_list
    return unless @actor
    
    Nana::KCC::ACTOR.each do |n|
      case n
      when 1
        add_attack_command
      when 2
        add_skill_commands
      when 3
        add_guard_command
      when 4
        add_item_command
      else
        add_n7_original_command(n) if Nana::OAC::C
      end
    end
  end
end
