#==============================================================================
# リージョンコモンイベント ver1.00
#------------------------------------------------------------------------------
#[特徴]
# リージョンに接触した際、コモンイベントを起動する。
#
# 作成：ぶちょー
# ホム：http://nyannyannyan.bake-neko.net/
# 著作：自分で作ったとか言わないで＞＜
#       改造はご自由にどうぞ。
#       リードミーとかに私の名前の載せたりするのは任意で。
#
#       注・リージョンを踏むとイベントが再起動してしまうので
#　　　　 　使いどころが限られる。
#
#==============================================================================

#==============================================================================
# バージョンアップ情報
# ver1.00 公開
#==============================================================================

#==============================================================================
# 設定項目
#==============================================================================
module Kazari
module RegionCommon
    # リージョンIDとコモンイベントIDの設定
    # リージョンID => コモンイベントID
    EVENT = {     
      35 => 285,
    }
end
end

$kzr_imported = {} if $kzr_imported == nil
$kzr_imported["RegionCommonEvent"] = true
#==============================================================================
# ■ Game_Player
#==============================================================================
class Game_Player < Game_Character
  #--------------------------------------------------------------------------
  # ● 接触（重なり）によるイベント起動判定
  #--------------------------------------------------------------------------
  alias kzr_region_common_check_touch_event check_touch_event
  def check_touch_event
    kzr_region_common_check_touch_event
    if Kazari::RegionCommon::EVENT.has_key?(region_id)
      $game_temp.reserve_common_event(Kazari::RegionCommon::EVENT[region_id])
    end
  end
end